# На вход подаётся одна строка, напишите программу, которая выводит
string = input("Введите строку: Д")

print(f"Третий символ этой строки: {string[2]}")
print(f"Предпоследний символ этой строки: {string[-2]}")
print(f"Первые 5 символов этой строки: {string[:5]}")
print(f"Кроме последних 2 символов: {string[:-2]}")
print(f"Все символы с чётными индексами: {string[::2]}")
print(f"Все символы с нечётными индексами: {string[1::2]}")
print(f"Все символы в обратном порядке: {string[::-1]}")
print(f"Все символы строки через один в обратном порядке, начиная с последнего: {string[::-1][::2]}")